MikroElektronika/core_packages/PIC/XC8/def/PIC18LF47J53/mcu.h
extern volatile PORTAbits_t PORTAbits __at(0xF80);
// bitfield macros
#define _PORTA_RA0_POSN                                     0x0
#define _PORTA_RA0_POSITION                                 0x0
#define _PORTA_RA0_SIZE                                     0x1
#define _PORTA_RA0_LENGTH                                   0x1
#define _PORTA_RA0_MASK                                     0x1
#define _PORTA_RA1_POSN                                     0x1
#define _PORTA_RA1_POSITION                                 0x1
#define _PORTA_RA1_SIZE                                     0x1
#define _PORTA_RA1_LENGTH                                   0x1
#define _PORTA_RA1_MASK                                     0x2
#define _PORTA_RA2_POSN                                     0x2
#define _PORTA_RA2_POSITION                                 0x2
#define _PORTA_RA2_SIZE                                     0x1
#define _PORTA_RA2_LENGTH                                   0x1
#define _PORTA_RA2_MASK                                     0x4
#define _PORTA_RA3_POSN                                     0x3
#define _PORTA_RA3_POSITION                                 0x3
#define _PORTA_RA3_SIZE                                     0x1
#define _PORTA_RA3_LENGTH                                   0x1
#define _PORTA_RA3_MASK                                     0x8
#define _PORTA_RA5_POSN                                     0x5
#define _PORTA_RA5_POSITION                                 0x5
#define _PORTA_RA5_SIZE                                     0x1
#define _PORTA_RA5_LENGTH                                   0x1
#define _PORTA_RA5_MASK                                     0x20
#define _PORTA_RA6_POSN                                     0x6
#define _PORTA_RA6_POSITION                                 0x6
#define _PORTA_RA6_SIZE                                     0x1
#define _PORTA_RA6_LENGTH                                   0x1
#define _PORTA_RA6_MASK                                     0x40
#define _PORTA_RA7_POSN                                     0x7
#define _PORTA_RA7_POSITION                                 0x7
#define _PORTA_RA7_SIZE                                     0x1
#define _PORTA_RA7_LENGTH                                   0x1
#define _PORTA_RA7_MASK                                     0x80
#define _PORTA_AN0_POSN                                     0x0
#define _PORTA_AN0_POSITION                                 0x0
#define _PORTA_AN0_SIZE                                     0x1
#define _PORTA_AN0_LENGTH                                   0x1
#define _PORTA_AN0_MASK                                     0x1
#define _PORTA_AN1_POSN                                     0x1
#define _PORTA_AN1_POSITION                                 0x1
#define _PORTA_AN1_SIZE                                     0x1
#define _PORTA_AN1_LENGTH                                   0x1
#define _PORTA_AN1_MASK                                     0x2
#define _PORTA_AN2_POSN                                     0x2
#define _PORTA_AN2_POSITION                                 0x2
#define _PORTA_AN2_SIZE                                     0x1
#define _PORTA_AN2_LENGTH                                   0x1
#define _PORTA_AN2_MASK                                     0x4
#define _PORTA_AN3_POSN                                     0x3
#define _PORTA_AN3_POSITION                                 0x3
#define _PORTA_AN3_SIZE                                     0x1
#define _PORTA_AN3_LENGTH                                   0x1
#define _PORTA_AN3_MASK                                     0x8
#define _PORTA_AN4_POSN                                     0x5
#define _PORTA_AN4_POSITION                                 0x5
#define _PORTA_AN4_SIZE                                     0x1
#define _PORTA_AN4_LENGTH                                   0x1
#define _PORTA_AN4_MASK                                     0x20
#define _PORTA_OSC2_POSN                                    0x6
#define _PORTA_OSC2_POSITION                                0x6
#define _PORTA_OSC2_SIZE                                    0x1
#define _PORTA_OSC2_LENGTH                                  0x1
#define _PORTA_OSC2_MASK                                    0x40
#define _PORTA_OSC1_POSN                                    0x7
#define _PORTA_OSC1_POSITION                                0x7
#define _PORTA_OSC1_SIZE                                    0x1
#define _PORTA_OSC1_LENGTH                                  0x1
#define _PORTA_OSC1_MASK                                    0x80
#define _PORTA_NOT_SS1_POSN                                 0x5
#define _PORTA_NOT_SS1_POSITION                             0x5
#define _PORTA_NOT_SS1_SIZE                                 0x1
#define _PORTA_NOT_SS1_LENGTH                               0x1
#define _PORTA_NOT_SS1_MASK                                 0x20
#define _PORTA_C1INA_POSN                                   0x0
#define _PORTA_C1INA_POSITION                               0x0
#define _PORTA_C1INA_SIZE                                   0x1
#define _PORTA_C1INA_LENGTH                                 0x1
#define _PORTA_C1INA_MASK                                   0x1
#define _PORTA_C2INA_POSN                                   0x1
#define _PORTA_C2INA_POSITION                               0x1
#define _PORTA_C2INA_SIZE                                   0x1
#define _PORTA_C2INA_LENGTH                                 0x1
#define _PORTA_C2INA_MASK                                   0x2
#define _PORTA_VREF_MINUS_POSN                              0x2
#define _PORTA_VREF_MINUS_POSITION                          0x2
#define _PORTA_VREF_MINUS_SIZE                              0x1
#define _PORTA_VREF_MINUS_LENGTH                            0x1
#define _PORTA_VREF_MINUS_MASK                              0x4
#define _PORTA_VREF_PLUS_POSN                               0x3
#define _PORTA_VREF_PLUS_POSITION                           0x3
#define _PORTA_VREF_PLUS_SIZE                               0x1
#define _PORTA_VREF_PLUS_LENGTH                             0x1
#define _PORTA_VREF_PLUS_MASK                               0x8
#define _PORTA_nSS1_POSN                                    0x5
#define _PORTA_nSS1_POSITION                                0x5
#define _PORTA_nSS1_SIZE                                    0x1
#define _PORTA_nSS1_LENGTH                                  0x1
#define _PORTA_nSS1_MASK                                    0x20
#define _PORTA_CLKO_POSN                                    0x6
#define _PORTA_CLKO_POSITION                                0x6
#define _PORTA_CLKO_SIZE                                    0x1
#define _PORTA_CLKO_LENGTH                                  0x1
#define _PORTA_CLKO_MASK                                    0x40
#define _PORTA_CLKI_POSN                                    0x7
#define _PORTA_CLKI_POSITION                                0x7
#define _PORTA_CLKI_SIZE                                    0x1
#define _PORTA_CLKI_LENGTH                                  0x1
#define _PORTA_CLKI_MASK                                    0x80
#define _PORTA_PMA6_POSN                                    0x0
#define _PORTA_PMA6_POSITION                                0x0
#define _PORTA_PMA6_SIZE                                    0x1
#define _PORTA_PMA6_LENGTH                                  0x1
#define _PORTA_PMA6_MASK                                    0x1
#define _PORTA_PMA7_POSN                                    0x1
#define _PORTA_PMA7_POSITION                                0x1
#define _PORTA_PMA7_SIZE                                    0x1
#define _PORTA_PMA7_LENGTH                                  0x1
#define _PORTA_PMA7_MASK                                    0x2
#define _PORTA_CVREF_POSN                                   0x2
#define _PORTA_CVREF_POSITION                               0x2
#define _PORTA_CVREF_SIZE                                   0x1
#define _PORTA_CVREF_LENGTH                                 0x1
#define _PORTA_CVREF_MASK                                   0x4
#define _PORTA_C1INB_POSN                                   0x3
#define _PORTA_C1INB_POSITION                               0x3
#define _PORTA_C1INB_SIZE                                   0x1
#define _PORTA_C1INB_LENGTH                                 0x1
#define _PORTA_C1INB_MASK                                   0x8
#define _PORTA_HLVDIN_POSN                                  0x5
#define _PORTA_HLVDIN_POSITION                              0x5
#define _PORTA_HLVDIN_SIZE                                  0x1
#define _PORTA_HLVDIN_LENGTH                                0x1
#define _PORTA_HLVDIN_MASK                                  0x20
#define _PORTA_RP0_POSN                                     0x0
#define _PORTA_RP0_POSITION                                 0x0
#define _PORTA_RP0_SIZE                                     0x1
#define _PORTA_RP0_LENGTH                                   0x1
#define _PORTA_RP0_MASK                                     0x1
#define _PORTA_RP1_POSN                                     0x1
#define _PORTA_RP1_POSITION                                 0x1
#define _PORTA_RP1_SIZE                                     0x1
#define _PORTA_RP1_LENGTH                                   0x1
#define _PORTA_RP1_MASK                                     0x2
#define _PORTA_C2INB_POSN                                   0x2
#define _PORTA_C2INB_POSITION                               0x2
#define _PORTA_C2INB_SIZE                                   0x1
#define _PORTA_C2INB_LENGTH                                 0x1
#define _PORTA_C2INB_MASK                                   0x4
#define _PORTA_RCV_POSN                                     0x5
#define _PORTA_RCV_POSITION                                 0x5
#define _PORTA_RCV_SIZE                                     0x1
#define _PORTA_RCV_LENGTH                                   0x1
#define _PORTA_RCV_MASK                                     0x20
#define _PORTA_ULPWU_POSN                                   0x0
#define _PORTA_ULPWU_POSITION                               0x0
#define _PORTA_ULPWU_SIZE                                   0x1
#define _PORTA_ULPWU_LENGTH                                 0x1
#define _PORTA_ULPWU_MASK                                   0x1
#define _PORTA_VBG_POSN                                     0x1
#define _PORTA_VBG_POSITION                                 0x1
#define _PORTA_VBG_SIZE                                     0x1
#define _PORTA_VBG_LENGTH                                   0x1
#define _PORTA_VBG_MASK                                     0x2
#define _PORTA_C1IND_POSN                                   0x2
#define _PORTA_C1IND_POSITION                               0x2
#define _PORTA_C1IND_SIZE                                   0x1
#define _PORTA_C1IND_LENGTH                                 0x1
#define _PORTA_C1IND_MASK                                   0x4
#define _PORTA_RP2_POSN                                     0x5
#define _PORTA_RP2_POSITION                                 0x5
#define _PORTA_RP2_SIZE                                     0x1
#define _PORTA_RP2_LENGTH                                   0x1
#define _PORTA_RP2_MASK                                     0x20
#define _PORTA_C3INB_POSN                                   0x2
#define _PORTA_C3INB_POSITION                               0x2
#define _PORTA_C3INB_SIZE                                   0x1
#define _PORTA_C3INB_LENGTH                                 0x1
#define _PORTA_C3INB_MASK                                   0x4
#define _PORTA_C1INC_POSN                                   0x5
#define _PORTA_C1INC_POSITION                               0x5
#define _PORTA_C1INC_SIZE                                   0x1
#define _PORTA_C1INC_LENGTH                                 0x1
#define _PORTA_C1INC_MASK                                   0x20
#define _PORTA_ULPWUIN_POSN                                 0x0
#define _PORTA_ULPWUIN_POSITION                             0x0
#define _PORTA_ULPWUIN_SIZE                                 0x1
#define _PORTA_ULPWUIN_LENGTH                               0x1
#define _PORTA_ULPWUIN_MASK                                 0x1
#define _PORTA_LVDIN_POSN                                   0x5
#define _PORTA_LVDIN_POSITION                               0x5
#define _PORTA_LVDIN_SIZE                                   0x1
#define _PORTA_LVDIN_LENGTH                                 0x1
#define _PORTA_LVDIN_MASK                                   0x20
#define _PORTA_RJPU_POSN                                    0x7
#define _PORTA_RJPU_POSITION                                0x7
#define _PORTA_RJPU_SIZE                                    0x1
#define _PORTA_RJPU_LENGTH                                  0x1
#define _PORTA_RJPU_MASK                                    0x80

// Register: PORTB
#define PORTB PORTB
extern volatile unsigned char           PORTB               __at(0xF81);
#ifndef _LIB_BUILD
asm("PORTB equ 0F81h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RB2                    :1;
        unsigned RB3                    :1;
        unsigned RB4                    :1;
        unsigned RB5                    :1;
        unsigned RB6                    :1;
        unsigned RB7                    :1;
    };
    struct {
        unsigned AN12                   :1;
        unsigned AN10                   :1;
        unsigned AN8                    :1;
        unsigned AN9                    :1;
        unsigned PMA1                   :1;
        unsigned PMA0                   :1;
        unsigned KBI2                   :1;
        unsigned KBI3                   :1;
    };
    struct {
        unsigned INT0                   :1;
        unsigned PMPBE                  :1;
        unsigned CTED1                  :1;
        unsigned CTED2                  :1;
        unsigned KBI0                   :1;
        unsigned KBI1                   :1;
        unsigned PGC                    :1;
        unsigned PGD                    :1;
    };
    struct {
        unsigned RP3                    :1;
        unsigned RTCC                   :1;
        unsigned PMA3                   :1;
        unsigned PMA2                   :1;
        unsigned SCK1                   :1;
        unsigned SDI1                   :1;
        unsigned RP9                    :1;
        unsigned RP10                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned RP4                    :1;
        unsigned VMO                    :1;
        unsigned VPO                    :1;
        unsigned SCL1                   :1;
        unsigned SDA1                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned REFO                   :1;
        unsigned RP6                    :1;
        unsigned RP7                    :1;
        unsigned RP8                    :1;
    };
    struct {
        unsigned                        :1;
        unsigned C3INC                  :1;
        unsigned RP5                    :1;
        unsigned C3INA                  :1;
        unsigned CCP4                   :1;
        unsigned CCP5                   :1;
        unsigned CCP6                   :1;
        unsigned CCP7                   :1;
    };
    struct {
        unsigned C3IND                  :1;
        unsigned PMBE                   :1;
        unsigned C2INC                  :1;
    };
    struct {
        unsigned                        :3;
        unsigned CCP2_PA2               :1;
    };
} PORTBbits_t;
