MikroElektronika/core_packages/PIC/XC8/def/PIC18LF47J53/mcu.h
extern volatile PORTBbits_t PORTBbits __at(0xF81);
// bitfield macros
#define _PORTB_RB0_POSN                                     0x0
#define _PORTB_RB0_POSITION                                 0x0
#define _PORTB_RB0_SIZE                                     0x1
#define _PORTB_RB0_LENGTH                                   0x1
#define _PORTB_RB0_MASK                                     0x1
#define _PORTB_RB1_POSN                                     0x1
#define _PORTB_RB1_POSITION                                 0x1
#define _PORTB_RB1_SIZE                                     0x1
#define _PORTB_RB1_LENGTH                                   0x1
#define _PORTB_RB1_MASK                                     0x2
#define _PORTB_RB2_POSN                                     0x2
#define _PORTB_RB2_POSITION                                 0x2
#define _PORTB_RB2_SIZE                                     0x1
#define _PORTB_RB2_LENGTH                                   0x1
#define _PORTB_RB2_MASK                                     0x4
#define _PORTB_RB3_POSN                                     0x3
#define _PORTB_RB3_POSITION                                 0x3
#define _PORTB_RB3_SIZE                                     0x1
#define _PORTB_RB3_LENGTH                                   0x1
#define _PORTB_RB3_MASK                                     0x8
#define _PORTB_RB4_POSN                                     0x4
#define _PORTB_RB4_POSITION                                 0x4
#define _PORTB_RB4_SIZE                                     0x1
#define _PORTB_RB4_LENGTH                                   0x1
#define _PORTB_RB4_MASK                                     0x10
#define _PORTB_RB5_POSN                                     0x5
#define _PORTB_RB5_POSITION                                 0x5
#define _PORTB_RB5_SIZE                                     0x1
#define _PORTB_RB5_LENGTH                                   0x1
#define _PORTB_RB5_MASK                                     0x20
#define _PORTB_RB6_POSN                                     0x6
#define _PORTB_RB6_POSITION                                 0x6
#define _PORTB_RB6_SIZE                                     0x1
#define _PORTB_RB6_LENGTH                                   0x1
#define _PORTB_RB6_MASK                                     0x40
#define _PORTB_RB7_POSN                                     0x7
#define _PORTB_RB7_POSITION                                 0x7
#define _PORTB_RB7_SIZE                                     0x1
#define _PORTB_RB7_LENGTH                                   0x1
#define _PORTB_RB7_MASK                                     0x80
#define _PORTB_AN12_POSN                                    0x0
#define _PORTB_AN12_POSITION                                0x0
#define _PORTB_AN12_SIZE                                    0x1
#define _PORTB_AN12_LENGTH                                  0x1
#define _PORTB_AN12_MASK                                    0x1
#define _PORTB_AN10_POSN                                    0x1
#define _PORTB_AN10_POSITION                                0x1
#define _PORTB_AN10_SIZE                                    0x1
#define _PORTB_AN10_LENGTH                                  0x1
#define _PORTB_AN10_MASK                                    0x2
#define _PORTB_AN8_POSN                                     0x2
#define _PORTB_AN8_POSITION                                 0x2
#define _PORTB_AN8_SIZE                                     0x1
#define _PORTB_AN8_LENGTH                                   0x1
#define _PORTB_AN8_MASK                                     0x4
#define _PORTB_AN9_POSN                                     0x3
#define _PORTB_AN9_POSITION                                 0x3
#define _PORTB_AN9_SIZE                                     0x1
#define _PORTB_AN9_LENGTH                                   0x1
#define _PORTB_AN9_MASK                                     0x8
#define _PORTB_PMA1_POSN                                    0x4
#define _PORTB_PMA1_POSITION                                0x4
#define _PORTB_PMA1_SIZE                                    0x1
#define _PORTB_PMA1_LENGTH                                  0x1
#define _PORTB_PMA1_MASK                                    0x10
#define _PORTB_PMA0_POSN                                    0x5
#define _PORTB_PMA0_POSITION                                0x5
#define _PORTB_PMA0_SIZE                                    0x1
#define _PORTB_PMA0_LENGTH                                  0x1
#define _PORTB_PMA0_MASK                                    0x20
#define _PORTB_KBI2_POSN                                    0x6
#define _PORTB_KBI2_POSITION                                0x6
#define _PORTB_KBI2_SIZE                                    0x1
#define _PORTB_KBI2_LENGTH                                  0x1
#define _PORTB_KBI2_MASK                                    0x40
#define _PORTB_KBI3_POSN                                    0x7
#define _PORTB_KBI3_POSITION                                0x7
#define _PORTB_KBI3_SIZE                                    0x1
#define _PORTB_KBI3_LENGTH                                  0x1
#define _PORTB_KBI3_MASK                                    0x80
#define _PORTB_INT0_POSN                                    0x0
#define _PORTB_INT0_POSITION                                0x0
#define _PORTB_INT0_SIZE                                    0x1
#define _PORTB_INT0_LENGTH                                  0x1
#define _PORTB_INT0_MASK                                    0x1
#define _PORTB_PMPBE_POSN                                   0x1
#define _PORTB_PMPBE_POSITION                               0x1
#define _PORTB_PMPBE_SIZE                                   0x1
#define _PORTB_PMPBE_LENGTH                                 0x1
#define _PORTB_PMPBE_MASK                                   0x2
#define _PORTB_CTED1_POSN                                   0x2
#define _PORTB_CTED1_POSITION                               0x2
#define _PORTB_CTED1_SIZE                                   0x1
#define _PORTB_CTED1_LENGTH                                 0x1
#define _PORTB_CTED1_MASK                                   0x4
#define _PORTB_CTED2_POSN                                   0x3
#define _PORTB_CTED2_POSITION                               0x3
#define _PORTB_CTED2_SIZE                                   0x1
#define _PORTB_CTED2_LENGTH                                 0x1
#define _PORTB_CTED2_MASK                                   0x8
#define _PORTB_KBI0_POSN                                    0x4
#define _PORTB_KBI0_POSITION                                0x4
#define _PORTB_KBI0_SIZE                                    0x1
#define _PORTB_KBI0_LENGTH                                  0x1
#define _PORTB_KBI0_MASK                                    0x10
#define _PORTB_KBI1_POSN                                    0x5
#define _PORTB_KBI1_POSITION                                0x5
#define _PORTB_KBI1_SIZE                                    0x1
#define _PORTB_KBI1_LENGTH                                  0x1
#define _PORTB_KBI1_MASK                                    0x20
#define _PORTB_PGC_POSN                                     0x6
#define _PORTB_PGC_POSITION                                 0x6
#define _PORTB_PGC_SIZE                                     0x1
#define _PORTB_PGC_LENGTH                                   0x1
#define _PORTB_PGC_MASK                                     0x40
#define _PORTB_PGD_POSN                                     0x7
#define _PORTB_PGD_POSITION                                 0x7
#define _PORTB_PGD_SIZE                                     0x1
#define _PORTB_PGD_LENGTH                                   0x1
#define _PORTB_PGD_MASK                                     0x80
#define _PORTB_RP3_POSN                                     0x0
#define _PORTB_RP3_POSITION                                 0x0
#define _PORTB_RP3_SIZE                                     0x1
#define _PORTB_RP3_LENGTH                                   0x1
#define _PORTB_RP3_MASK                                     0x1
#define _PORTB_RTCC_POSN                                    0x1
#define _PORTB_RTCC_POSITION                                0x1
#define _PORTB_RTCC_SIZE                                    0x1
#define _PORTB_RTCC_LENGTH                                  0x1
#define _PORTB_RTCC_MASK                                    0x2
#define _PORTB_PMA3_POSN                                    0x2
#define _PORTB_PMA3_POSITION                                0x2
#define _PORTB_PMA3_SIZE                                    0x1
#define _PORTB_PMA3_LENGTH                                  0x1
#define _PORTB_PMA3_MASK                                    0x4
#define _PORTB_PMA2_POSN                                    0x3
#define _PORTB_PMA2_POSITION                                0x3
#define _PORTB_PMA2_SIZE                                    0x1
#define _PORTB_PMA2_LENGTH                                  0x1
#define _PORTB_PMA2_MASK                                    0x8
#define _PORTB_SCK1_POSN                                    0x4
#define _PORTB_SCK1_POSITION                                0x4
#define _PORTB_SCK1_SIZE                                    0x1
#define _PORTB_SCK1_LENGTH                                  0x1
#define _PORTB_SCK1_MASK                                    0x10
#define _PORTB_SDI1_POSN                                    0x5
#define _PORTB_SDI1_POSITION                                0x5
#define _PORTB_SDI1_SIZE                                    0x1
#define _PORTB_SDI1_LENGTH                                  0x1
#define _PORTB_SDI1_MASK                                    0x20
#define _PORTB_RP9_POSN                                     0x6
#define _PORTB_RP9_POSITION                                 0x6
#define _PORTB_RP9_SIZE                                     0x1
#define _PORTB_RP9_LENGTH                                   0x1
#define _PORTB_RP9_MASK                                     0x40
#define _PORTB_RP10_POSN                                    0x7
#define _PORTB_RP10_POSITION                                0x7
#define _PORTB_RP10_SIZE                                    0x1
#define _PORTB_RP10_LENGTH                                  0x1
#define _PORTB_RP10_MASK                                    0x80
#define _PORTB_RP4_POSN                                     0x1
#define _PORTB_RP4_POSITION                                 0x1
#define _PORTB_RP4_SIZE                                     0x1
#define _PORTB_RP4_LENGTH                                   0x1
#define _PORTB_RP4_MASK                                     0x2
#define _PORTB_VMO_POSN                                     0x2
#define _PORTB_VMO_POSITION                                 0x2
#define _PORTB_VMO_SIZE                                     0x1
#define _PORTB_VMO_LENGTH                                   0x1
#define _PORTB_VMO_MASK                                     0x4
#define _PORTB_VPO_POSN                                     0x3
#define _PORTB_VPO_POSITION                                 0x3
#define _PORTB_VPO_SIZE                                     0x1
#define _PORTB_VPO_LENGTH                                   0x1
#define _PORTB_VPO_MASK                                     0x8
#define _PORTB_SCL1_POSN                                    0x4
#define _PORTB_SCL1_POSITION                                0x4
#define _PORTB_SCL1_SIZE                                    0x1
#define _PORTB_SCL1_LENGTH                                  0x1
#define _PORTB_SCL1_MASK                                    0x10
#define _PORTB_SDA1_POSN                                    0x5
#define _PORTB_SDA1_POSITION                                0x5
#define _PORTB_SDA1_SIZE                                    0x1
#define _PORTB_SDA1_LENGTH                                  0x1
#define _PORTB_SDA1_MASK                                    0x20
#define _PORTB_REFO_POSN                                    0x2
#define _PORTB_REFO_POSITION                                0x2
#define _PORTB_REFO_SIZE                                    0x1
#define _PORTB_REFO_LENGTH                                  0x1
#define _PORTB_REFO_MASK                                    0x4
#define _PORTB_RP6_POSN                                     0x3
#define _PORTB_RP6_POSITION                                 0x3
#define _PORTB_RP6_SIZE                                     0x1
#define _PORTB_RP6_LENGTH                                   0x1
#define _PORTB_RP6_MASK                                     0x8
#define _PORTB_RP7_POSN                                     0x4
#define _PORTB_RP7_POSITION                                 0x4
#define _PORTB_RP7_SIZE                                     0x1
#define _PORTB_RP7_LENGTH                                   0x1
#define _PORTB_RP7_MASK                                     0x10
#define _PORTB_RP8_POSN                                     0x5
#define _PORTB_RP8_POSITION                                 0x5
#define _PORTB_RP8_SIZE                                     0x1
#define _PORTB_RP8_LENGTH                                   0x1
#define _PORTB_RP8_MASK                                     0x20
#define _PORTB_C3INC_POSN                                   0x1
#define _PORTB_C3INC_POSITION                               0x1
#define _PORTB_C3INC_SIZE                                   0x1
#define _PORTB_C3INC_LENGTH                                 0x1
#define _PORTB_C3INC_MASK                                   0x2
#define _PORTB_RP5_POSN                                     0x2
#define _PORTB_RP5_POSITION                                 0x2
#define _PORTB_RP5_SIZE                                     0x1
#define _PORTB_RP5_LENGTH                                   0x1
#define _PORTB_RP5_MASK                                     0x4
#define _PORTB_C3INA_POSN                                   0x3
#define _PORTB_C3INA_POSITION                               0x3
#define _PORTB_C3INA_SIZE                                   0x1
#define _PORTB_C3INA_LENGTH                                 0x1
#define _PORTB_C3INA_MASK                                   0x8
#define _PORTB_CCP4_POSN                                    0x4
#define _PORTB_CCP4_POSITION                                0x4
#define _PORTB_CCP4_SIZE                                    0x1
#define _PORTB_CCP4_LENGTH                                  0x1
#define _PORTB_CCP4_MASK                                    0x10
#define _PORTB_CCP5_POSN                                    0x5
#define _PORTB_CCP5_POSITION                                0x5
#define _PORTB_CCP5_SIZE                                    0x1
#define _PORTB_CCP5_LENGTH                                  0x1
#define _PORTB_CCP5_MASK                                    0x20
#define _PORTB_CCP6_POSN                                    0x6
#define _PORTB_CCP6_POSITION                                0x6
#define _PORTB_CCP6_SIZE                                    0x1
#define _PORTB_CCP6_LENGTH                                  0x1
#define _PORTB_CCP6_MASK                                    0x40
#define _PORTB_CCP7_POSN                                    0x7
#define _PORTB_CCP7_POSITION                                0x7
#define _PORTB_CCP7_SIZE                                    0x1
#define _PORTB_CCP7_LENGTH                                  0x1
#define _PORTB_CCP7_MASK                                    0x80
#define _PORTB_C3IND_POSN                                   0x0
#define _PORTB_C3IND_POSITION                               0x0
#define _PORTB_C3IND_SIZE                                   0x1
#define _PORTB_C3IND_LENGTH                                 0x1
#define _PORTB_C3IND_MASK                                   0x1
#define _PORTB_PMBE_POSN                                    0x1
#define _PORTB_PMBE_POSITION                                0x1
#define _PORTB_PMBE_SIZE                                    0x1
#define _PORTB_PMBE_LENGTH                                  0x1
#define _PORTB_PMBE_MASK                                    0x2
#define _PORTB_C2INC_POSN                                   0x2
#define _PORTB_C2INC_POSITION                               0x2
#define _PORTB_C2INC_SIZE                                   0x1
#define _PORTB_C2INC_LENGTH                                 0x1
#define _PORTB_C2INC_MASK                                   0x4
#define _PORTB_CCP2_PA2_POSN                                0x3
#define _PORTB_CCP2_PA2_POSITION                            0x3
#define _PORTB_CCP2_PA2_SIZE                                0x1
#define _PORTB_CCP2_PA2_LENGTH                              0x1
#define _PORTB_CCP2_PA2_MASK                                0x8

// Register: PORTC
#define PORTC PORTC
extern volatile unsigned char           PORTC               __at(0xF82);
#ifndef _LIB_BUILD
asm("PORTC equ 0F82h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC0                    :1;
        unsigned RC1                    :1;
        unsigned RC2                    :1;
        unsigned                        :1;
        unsigned RC4                    :1;
        unsigned RC5                    :1;
        unsigned RC6                    :1;
        unsigned RC7                    :1;
    };
    struct {
        unsigned T1OSO                  :1;
        unsigned T1OSI                  :1;
        unsigned AN11                   :1;
        unsigned                        :1;
        unsigned D_MINUS                :1;
        unsigned D_PLUS                 :1;
        unsigned PMA5                   :1;
        unsigned PMA4                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned NOT_UOE                :1;
    };
    struct {
        unsigned T1CKI                  :1;
        unsigned nUOE                   :1;
        unsigned CTPLS                  :1;
        unsigned                        :1;
        unsigned VM                     :1;
        unsigned VP                     :1;
        unsigned TX1                    :1;
        unsigned RX1                    :1;
    };
    struct {
        unsigned RP11                   :1;
        unsigned RP12                   :1;
        unsigned RP13                   :1;
        unsigned                        :3;
        unsigned CK1                    :1;
        unsigned DT1                    :1;
    };
    struct {
        unsigned                        :6;
        unsigned RP17                   :1;
        unsigned SDO1                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned C2IND                  :1;
        unsigned                        :4;
        unsigned RP18                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned CCP8                   :1;
        unsigned                        :4;
        unsigned CCP9                   :1;
        unsigned CCP10                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned CCP2                   :1;
        unsigned _PA1                    :1;  // Note: Changed by MikroE
    };
    struct {
        unsigned                        :1;
        unsigned _PA2                    :1;  // Note: Changed by MikroE
    };
} PORTCbits_t;
