MikroElektronika/core_packages/PIC/XC8/def/PIC18LF47J53/mcu.h
// Register: PSTR2CON
#define PSTR2CON PSTR2CON
extern volatile unsigned char           PSTR2CON            __at(0xFB9);
#ifndef _LIB_BUILD
asm("PSTR2CON equ 0FB9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STRA                   :1;
        unsigned STRB                   :1;
        unsigned STRC                   :1;
        unsigned STRD                   :1;
        unsigned STRSYNC                :1;
        unsigned                        :1;
        unsigned CMPL0                  :1;
        unsigned CMPL1                  :1;
    };
    struct {
        unsigned P2DC0                  :1;
        unsigned P2DC1                  :1;
        unsigned P2DC2                  :1;
        unsigned P2DC3                  :1;
        unsigned P2DC4                  :1;
        unsigned P2DC5                  :1;
        unsigned P2DC6                  :1;
    };
    struct {
        unsigned P2DC02                 :1;
        unsigned P2DC12                 :1;
        unsigned P2DC22                 :1;
        unsigned P2DC32                 :1;
        unsigned P2DC42                 :1;
        unsigned                        :1;
        unsigned CMPL02                 :1;
        unsigned CMPL12                 :1;
    };
    struct {
        unsigned P2DC0CON               :1;
        unsigned P2DC1CON               :1;
        unsigned P2DC2CON               :1;
        unsigned P2DC3CON               :1;
        unsigned P2DC4CON               :1;
        unsigned                        :1;
        unsigned P2DC62                 :1;
    };
    struct {
        unsigned STRA2                  :1;
        unsigned STRB2                  :1;
        unsigned STRC2                  :1;
        unsigned STRD2                  :1;
        unsigned STRSYNC2               :1;
        unsigned                        :1;
        unsigned P2DC6CON               :1;
    };
    struct {
        unsigned                        :5;
        unsigned P2DC52                 :1;
    };
    struct {
        unsigned                        :5;
        unsigned P2DC5CON               :1;
    };
} PSTR2CONbits_t;
extern volatile PSTR2CONbits_t PSTR2CONbits __at(0xFB9);
// bitfield macros
#define _PSTR2CON_STRA_POSN                                 0x0
#define _PSTR2CON_STRA_POSITION                             0x0
#define _PSTR2CON_STRA_SIZE                                 0x1
#define _PSTR2CON_STRA_LENGTH                               0x1
#define _PSTR2CON_STRA_MASK                                 0x1
#define _PSTR2CON_STRB_POSN                                 0x1
#define _PSTR2CON_STRB_POSITION                             0x1
#define _PSTR2CON_STRB_SIZE                                 0x1
#define _PSTR2CON_STRB_LENGTH                               0x1
#define _PSTR2CON_STRB_MASK                                 0x2
#define _PSTR2CON_STRC_POSN                                 0x2
#define _PSTR2CON_STRC_POSITION                             0x2
#define _PSTR2CON_STRC_SIZE                                 0x1
#define _PSTR2CON_STRC_LENGTH                               0x1
#define _PSTR2CON_STRC_MASK                                 0x4
#define _PSTR2CON_STRD_POSN                                 0x3
#define _PSTR2CON_STRD_POSITION                             0x3
#define _PSTR2CON_STRD_SIZE                                 0x1
#define _PSTR2CON_STRD_LENGTH                               0x1
#define _PSTR2CON_STRD_MASK                                 0x8
#define _PSTR2CON_STRSYNC_POSN                              0x4
#define _PSTR2CON_STRSYNC_POSITION                          0x4
#define _PSTR2CON_STRSYNC_SIZE                              0x1
#define _PSTR2CON_STRSYNC_LENGTH                            0x1
#define _PSTR2CON_STRSYNC_MASK                              0x10
#define _PSTR2CON_CMPL0_POSN                                0x6
#define _PSTR2CON_CMPL0_POSITION                            0x6
#define _PSTR2CON_CMPL0_SIZE                                0x1
#define _PSTR2CON_CMPL0_LENGTH                              0x1
#define _PSTR2CON_CMPL0_MASK                                0x40
#define _PSTR2CON_CMPL1_POSN                                0x7
#define _PSTR2CON_CMPL1_POSITION                            0x7
#define _PSTR2CON_CMPL1_SIZE                                0x1
#define _PSTR2CON_CMPL1_LENGTH                              0x1
#define _PSTR2CON_CMPL1_MASK                                0x80
#define _PSTR2CON_P2DC0_POSN                                0x0
#define _PSTR2CON_P2DC0_POSITION                            0x0
#define _PSTR2CON_P2DC0_SIZE                                0x1
#define _PSTR2CON_P2DC0_LENGTH                              0x1
#define _PSTR2CON_P2DC0_MASK                                0x1
#define _PSTR2CON_P2DC1_POSN                                0x1
#define _PSTR2CON_P2DC1_POSITION                            0x1
#define _PSTR2CON_P2DC1_SIZE                                0x1
#define _PSTR2CON_P2DC1_LENGTH                              0x1
#define _PSTR2CON_P2DC1_MASK                                0x2
#define _PSTR2CON_P2DC2_POSN                                0x2
#define _PSTR2CON_P2DC2_POSITION                            0x2
#define _PSTR2CON_P2DC2_SIZE                                0x1
#define _PSTR2CON_P2DC2_LENGTH                              0x1
#define _PSTR2CON_P2DC2_MASK                                0x4
#define _PSTR2CON_P2DC3_POSN                                0x3
#define _PSTR2CON_P2DC3_POSITION                            0x3
#define _PSTR2CON_P2DC3_SIZE                                0x1
#define _PSTR2CON_P2DC3_LENGTH                              0x1
#define _PSTR2CON_P2DC3_MASK                                0x8
#define _PSTR2CON_P2DC4_POSN                                0x4
#define _PSTR2CON_P2DC4_POSITION                            0x4
#define _PSTR2CON_P2DC4_SIZE                                0x1
#define _PSTR2CON_P2DC4_LENGTH                              0x1
#define _PSTR2CON_P2DC4_MASK                                0x10
#define _PSTR2CON_P2DC5_POSN                                0x5
#define _PSTR2CON_P2DC5_POSITION                            0x5
#define _PSTR2CON_P2DC5_SIZE                                0x1
#define _PSTR2CON_P2DC5_LENGTH                              0x1
#define _PSTR2CON_P2DC5_MASK                                0x20
#define _PSTR2CON_P2DC6_POSN                                0x6
#define _PSTR2CON_P2DC6_POSITION                            0x6
#define _PSTR2CON_P2DC6_SIZE                                0x1
#define _PSTR2CON_P2DC6_LENGTH                              0x1
#define _PSTR2CON_P2DC6_MASK                                0x40
#define _PSTR2CON_P2DC02_POSN                               0x0
#define _PSTR2CON_P2DC02_POSITION                           0x0
#define _PSTR2CON_P2DC02_SIZE                               0x1
#define _PSTR2CON_P2DC02_LENGTH                             0x1
#define _PSTR2CON_P2DC02_MASK                               0x1
#define _PSTR2CON_P2DC12_POSN                               0x1
#define _PSTR2CON_P2DC12_POSITION                           0x1
#define _PSTR2CON_P2DC12_SIZE                               0x1
#define _PSTR2CON_P2DC12_LENGTH                             0x1
#define _PSTR2CON_P2DC12_MASK                               0x2
#define _PSTR2CON_P2DC22_POSN                               0x2
#define _PSTR2CON_P2DC22_POSITION                           0x2
#define _PSTR2CON_P2DC22_SIZE                               0x1
#define _PSTR2CON_P2DC22_LENGTH                             0x1
#define _PSTR2CON_P2DC22_MASK                               0x4
#define _PSTR2CON_P2DC32_POSN                               0x3
#define _PSTR2CON_P2DC32_POSITION                           0x3
#define _PSTR2CON_P2DC32_SIZE                               0x1
#define _PSTR2CON_P2DC32_LENGTH                             0x1
#define _PSTR2CON_P2DC32_MASK                               0x8
#define _PSTR2CON_P2DC42_POSN                               0x4
#define _PSTR2CON_P2DC42_POSITION                           0x4
#define _PSTR2CON_P2DC42_SIZE                               0x1
#define _PSTR2CON_P2DC42_LENGTH                             0x1
#define _PSTR2CON_P2DC42_MASK                               0x10
#define _PSTR2CON_CMPL02_POSN                               0x6
#define _PSTR2CON_CMPL02_POSITION                           0x6
#define _PSTR2CON_CMPL02_SIZE                               0x1
#define _PSTR2CON_CMPL02_LENGTH                             0x1
#define _PSTR2CON_CMPL02_MASK                               0x40
#define _PSTR2CON_CMPL12_POSN                               0x7
#define _PSTR2CON_CMPL12_POSITION                           0x7
#define _PSTR2CON_CMPL12_SIZE                               0x1
#define _PSTR2CON_CMPL12_LENGTH                             0x1
#define _PSTR2CON_CMPL12_MASK                               0x80
#define _PSTR2CON_P2DC0CON_POSN                             0x0
#define _PSTR2CON_P2DC0CON_POSITION                         0x0
#define _PSTR2CON_P2DC0CON_SIZE                             0x1
#define _PSTR2CON_P2DC0CON_LENGTH                           0x1
#define _PSTR2CON_P2DC0CON_MASK                             0x1
#define _PSTR2CON_P2DC1CON_POSN                             0x1
#define _PSTR2CON_P2DC1CON_POSITION                         0x1
#define _PSTR2CON_P2DC1CON_SIZE                             0x1
#define _PSTR2CON_P2DC1CON_LENGTH                           0x1
#define _PSTR2CON_P2DC1CON_MASK                             0x2
#define _PSTR2CON_P2DC2CON_POSN                             0x2
#define _PSTR2CON_P2DC2CON_POSITION                         0x2
#define _PSTR2CON_P2DC2CON_SIZE                             0x1
#define _PSTR2CON_P2DC2CON_LENGTH                           0x1
#define _PSTR2CON_P2DC2CON_MASK                             0x4
#define _PSTR2CON_P2DC3CON_POSN                             0x3
#define _PSTR2CON_P2DC3CON_POSITION                         0x3
#define _PSTR2CON_P2DC3CON_SIZE                             0x1
#define _PSTR2CON_P2DC3CON_LENGTH                           0x1
#define _PSTR2CON_P2DC3CON_MASK                             0x8
#define _PSTR2CON_P2DC4CON_POSN                             0x4
#define _PSTR2CON_P2DC4CON_POSITION                         0x4
#define _PSTR2CON_P2DC4CON_SIZE                             0x1
#define _PSTR2CON_P2DC4CON_LENGTH                           0x1
#define _PSTR2CON_P2DC4CON_MASK                             0x10
#define _PSTR2CON_P2DC62_POSN                               0x6
#define _PSTR2CON_P2DC62_POSITION                           0x6
#define _PSTR2CON_P2DC62_SIZE                               0x1
#define _PSTR2CON_P2DC62_LENGTH                             0x1
#define _PSTR2CON_P2DC62_MASK                               0x40
#define _PSTR2CON_STRA2_POSN                                0x0
#define _PSTR2CON_STRA2_POSITION                            0x0
#define _PSTR2CON_STRA2_SIZE                                0x1
#define _PSTR2CON_STRA2_LENGTH                              0x1
#define _PSTR2CON_STRA2_MASK                                0x1
#define _PSTR2CON_STRB2_POSN                                0x1
#define _PSTR2CON_STRB2_POSITION                            0x1
#define _PSTR2CON_STRB2_SIZE                                0x1
#define _PSTR2CON_STRB2_LENGTH                              0x1
#define _PSTR2CON_STRB2_MASK                                0x2
#define _PSTR2CON_STRC2_POSN                                0x2
#define _PSTR2CON_STRC2_POSITION                            0x2
#define _PSTR2CON_STRC2_SIZE                                0x1
#define _PSTR2CON_STRC2_LENGTH                              0x1
#define _PSTR2CON_STRC2_MASK                                0x4
#define _PSTR2CON_STRD2_POSN                                0x3
#define _PSTR2CON_STRD2_POSITION                            0x3
#define _PSTR2CON_STRD2_SIZE                                0x1
#define _PSTR2CON_STRD2_LENGTH                              0x1
#define _PSTR2CON_STRD2_MASK                                0x8
#define _PSTR2CON_STRSYNC2_POSN                             0x4
#define _PSTR2CON_STRSYNC2_POSITION                         0x4
#define _PSTR2CON_STRSYNC2_SIZE                             0x1
#define _PSTR2CON_STRSYNC2_LENGTH                           0x1
#define _PSTR2CON_STRSYNC2_MASK                             0x10
#define _PSTR2CON_P2DC6CON_POSN                             0x6
#define _PSTR2CON_P2DC6CON_POSITION                         0x6
#define _PSTR2CON_P2DC6CON_SIZE                             0x1
#define _PSTR2CON_P2DC6CON_LENGTH                           0x1
#define _PSTR2CON_P2DC6CON_MASK                             0x40
#define _PSTR2CON_P2DC52_POSN                               0x5
#define _PSTR2CON_P2DC52_POSITION                           0x5
#define _PSTR2CON_P2DC52_SIZE                               0x1
#define _PSTR2CON_P2DC52_LENGTH                             0x1
#define _PSTR2CON_P2DC52_MASK                               0x20
#define _PSTR2CON_P2DC5CON_POSN                             0x5
#define _PSTR2CON_P2DC5CON_POSITION                         0x5
#define _PSTR2CON_P2DC5CON_SIZE                             0x1
#define _PSTR2CON_P2DC5CON_LENGTH                           0x1
#define _PSTR2CON_P2DC5CON_MASK                             0x20

// Register: CCP1CON
#define CCP1CON CCP1CON
extern volatile unsigned char           CCP1CON             __at(0xFBA);
#ifndef _LIB_BUILD
asm("CCP1CON equ 0FBAh");
#endif
// aliases
extern volatile unsigned char           ECCP1CON            __at(0xFBA);
#ifndef _LIB_BUILD
asm("ECCP1CON equ 0FBAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1M                  :4;
        unsigned DC1B                   :2;
        unsigned P1M                    :2;
    };
    struct {
        unsigned CCP1M0                 :1;
        unsigned CCP1M1                 :1;
        unsigned CCP1M2                 :1;
        unsigned CCP1M3                 :1;
        unsigned DC1B0                  :1;
        unsigned DC1B1                  :1;
        unsigned P1M0                   :1;
        unsigned P1M1                   :1;
    };
    struct {
        unsigned                        :4;
        unsigned CCP1Y                  :1;
        unsigned CCP1X                  :1;
    };
} CCP1CONbits_t;
extern volatile CCP1CONbits_t CCP1CONbits __at(0xFBA);
// bitfield macros
#define _CCP1CON_CCP1M_POSN                                 0x0
#define _CCP1CON_CCP1M_POSITION                             0x0
#define _CCP1CON_CCP1M_SIZE                                 0x4
#define _CCP1CON_CCP1M_LENGTH                               0x4
#define _CCP1CON_CCP1M_MASK                                 0xF
#define _CCP1CON_DC1B_POSN                                  0x4
#define _CCP1CON_DC1B_POSITION                              0x4
#define _CCP1CON_DC1B_SIZE                                  0x2
#define _CCP1CON_DC1B_LENGTH                                0x2
#define _CCP1CON_DC1B_MASK                                  0x30
#define _CCP1CON_P1M_POSN                                   0x6
#define _CCP1CON_P1M_POSITION                               0x6
#define _CCP1CON_P1M_SIZE                                   0x2
#define _CCP1CON_P1M_LENGTH                                 0x2
#define _CCP1CON_P1M_MASK                                   0xC0
#define _CCP1CON_CCP1M0_POSN                                0x0
#define _CCP1CON_CCP1M0_POSITION                            0x0
#define _CCP1CON_CCP1M0_SIZE                                0x1
#define _CCP1CON_CCP1M0_LENGTH                              0x1
#define _CCP1CON_CCP1M0_MASK                                0x1
#define _CCP1CON_CCP1M1_POSN                                0x1
#define _CCP1CON_CCP1M1_POSITION                            0x1
#define _CCP1CON_CCP1M1_SIZE                                0x1
#define _CCP1CON_CCP1M1_LENGTH                              0x1
#define _CCP1CON_CCP1M1_MASK                                0x2
#define _CCP1CON_CCP1M2_POSN                                0x2
#define _CCP1CON_CCP1M2_POSITION                            0x2
#define _CCP1CON_CCP1M2_SIZE                                0x1
#define _CCP1CON_CCP1M2_LENGTH                              0x1
#define _CCP1CON_CCP1M2_MASK                                0x4
#define _CCP1CON_CCP1M3_POSN                                0x3
#define _CCP1CON_CCP1M3_POSITION                            0x3
#define _CCP1CON_CCP1M3_SIZE                                0x1
#define _CCP1CON_CCP1M3_LENGTH                              0x1
#define _CCP1CON_CCP1M3_MASK                                0x8
#define _CCP1CON_DC1B0_POSN                                 0x4
#define _CCP1CON_DC1B0_POSITION                             0x4
#define _CCP1CON_DC1B0_SIZE                                 0x1
#define _CCP1CON_DC1B0_LENGTH                               0x1
#define _CCP1CON_DC1B0_MASK                                 0x10
#define _CCP1CON_DC1B1_POSN                                 0x5
#define _CCP1CON_DC1B1_POSITION                             0x5
#define _CCP1CON_DC1B1_SIZE                                 0x1
#define _CCP1CON_DC1B1_LENGTH                               0x1
#define _CCP1CON_DC1B1_MASK                                 0x20
#define _CCP1CON_P1M0_POSN                                  0x6
#define _CCP1CON_P1M0_POSITION                              0x6
#define _CCP1CON_P1M0_SIZE                                  0x1
#define _CCP1CON_P1M0_LENGTH                                0x1
#define _CCP1CON_P1M0_MASK                                  0x40
#define _CCP1CON_P1M1_POSN                                  0x7
#define _CCP1CON_P1M1_POSITION                              0x7
#define _CCP1CON_P1M1_SIZE                                  0x1
#define _CCP1CON_P1M1_LENGTH                                0x1
#define _CCP1CON_P1M1_MASK                                  0x80
#define _CCP1CON_CCP1Y_POSN                                 0x4
#define _CCP1CON_CCP1Y_POSITION                             0x4
#define _CCP1CON_CCP1Y_SIZE                                 0x1
#define _CCP1CON_CCP1Y_LENGTH                               0x1
#define _CCP1CON_CCP1Y_MASK                                 0x10
#define _CCP1CON_CCP1X_POSN                                 0x5
#define _CCP1CON_CCP1X_POSITION                             0x5
#define _CCP1CON_CCP1X_SIZE                                 0x1
#define _CCP1CON_CCP1X_LENGTH                               0x1
#define _CCP1CON_CCP1X_MASK                                 0x20
// alias bitfield definitions
typedef union {
    struct {
        unsigned CCP1M                  :4;
        unsigned DC1B                   :2;
        unsigned P1M                    :2;
    };
    struct {
        unsigned CCP1M0                 :1;
        unsigned CCP1M1                 :1;
        unsigned CCP1M2                 :1;
        unsigned CCP1M3                 :1;
        unsigned DC1B0                  :1;
        unsigned DC1B1                  :1;
        unsigned P1M0                   :1;
        unsigned P1M1                   :1;
    };
    struct {
        unsigned                        :4;
        unsigned CCP1Y                  :1;
        unsigned CCP1X                  :1;
    };
} ECCP1CONbits_t;
extern volatile ECCP1CONbits_t ECCP1CONbits __at(0xFBA);
// bitfield macros
#define _ECCP1CON_CCP1M_POSN                                0x0
#define _ECCP1CON_CCP1M_POSITION                            0x0
#define _ECCP1CON_CCP1M_SIZE                                0x4
#define _ECCP1CON_CCP1M_LENGTH                              0x4
#define _ECCP1CON_CCP1M_MASK                                0xF
#define _ECCP1CON_DC1B_POSN                                 0x4
#define _ECCP1CON_DC1B_POSITION                             0x4
#define _ECCP1CON_DC1B_SIZE                                 0x2
#define _ECCP1CON_DC1B_LENGTH                               0x2
#define _ECCP1CON_DC1B_MASK                                 0x30
#define _ECCP1CON_P1M_POSN                                  0x6
#define _ECCP1CON_P1M_POSITION                              0x6
#define _ECCP1CON_P1M_SIZE                                  0x2
#define _ECCP1CON_P1M_LENGTH                                0x2
#define _ECCP1CON_P1M_MASK                                  0xC0
#define _ECCP1CON_CCP1M0_POSN                               0x0
#define _ECCP1CON_CCP1M0_POSITION                           0x0
#define _ECCP1CON_CCP1M0_SIZE                               0x1
#define _ECCP1CON_CCP1M0_LENGTH                             0x1
#define _ECCP1CON_CCP1M0_MASK                               0x1
#define _ECCP1CON_CCP1M1_POSN                               0x1
#define _ECCP1CON_CCP1M1_POSITION                           0x1
#define _ECCP1CON_CCP1M1_SIZE                               0x1
#define _ECCP1CON_CCP1M1_LENGTH                             0x1
#define _ECCP1CON_CCP1M1_MASK                               0x2
#define _ECCP1CON_CCP1M2_POSN                               0x2
#define _ECCP1CON_CCP1M2_POSITION                           0x2
#define _ECCP1CON_CCP1M2_SIZE                               0x1
#define _ECCP1CON_CCP1M2_LENGTH                             0x1
#define _ECCP1CON_CCP1M2_MASK                               0x4
#define _ECCP1CON_CCP1M3_POSN                               0x3
#define _ECCP1CON_CCP1M3_POSITION                           0x3
#define _ECCP1CON_CCP1M3_SIZE                               0x1
#define _ECCP1CON_CCP1M3_LENGTH                             0x1
#define _ECCP1CON_CCP1M3_MASK                               0x8
#define _ECCP1CON_DC1B0_POSN                                0x4
#define _ECCP1CON_DC1B0_POSITION                            0x4
#define _ECCP1CON_DC1B0_SIZE                                0x1
#define _ECCP1CON_DC1B0_LENGTH                              0x1
#define _ECCP1CON_DC1B0_MASK                                0x10
#define _ECCP1CON_DC1B1_POSN                                0x5
#define _ECCP1CON_DC1B1_POSITION                            0x5
#define _ECCP1CON_DC1B1_SIZE                                0x1
#define _ECCP1CON_DC1B1_LENGTH                              0x1
#define _ECCP1CON_DC1B1_MASK                                0x20
#define _ECCP1CON_P1M0_POSN                                 0x6
#define _ECCP1CON_P1M0_POSITION                             0x6
#define _ECCP1CON_P1M0_SIZE                                 0x1
#define _ECCP1CON_P1M0_LENGTH                               0x1
#define _ECCP1CON_P1M0_MASK                                 0x40
#define _ECCP1CON_P1M1_POSN                                 0x7
#define _ECCP1CON_P1M1_POSITION                             0x7
#define _ECCP1CON_P1M1_SIZE                                 0x1
#define _ECCP1CON_P1M1_LENGTH                               0x1
#define _ECCP1CON_P1M1_MASK                                 0x80
#define _ECCP1CON_CCP1Y_POSN                                0x4
#define _ECCP1CON_CCP1Y_POSITION                            0x4
#define _ECCP1CON_CCP1Y_SIZE                                0x1
#define _ECCP1CON_CCP1Y_LENGTH                              0x1
#define _ECCP1CON_CCP1Y_MASK                                0x10
#define _ECCP1CON_CCP1X_POSN                                0x5
#define _ECCP1CON_CCP1X_POSITION                            0x5
#define _ECCP1CON_CCP1X_SIZE                                0x1
#define _ECCP1CON_CCP1X_LENGTH                              0x1
#define _ECCP1CON_CCP1X_MASK                                0x20

// Register: CCPR1
#define CCPR1 CCPR1
extern volatile unsigned short          CCPR1               __at(0xFBB);
#ifndef _LIB_BUILD
asm("CCPR1 equ 0FBBh");
#endif

