MikroElektronika/core_packages/PIC/XC8/def/PIC18LF47J53/mcu.h
extern volatile __bit                   CCP9IE              __at(0x7C76);	// @ (0xF8E * 8 + 6)
#define                                 CCP9IE_bit          _BIT_ACCESS(PIE4,6)
// PIR4<CCP9IF>
extern volatile __bit                   CCP9IF              __at(0x7C7E);	// @ (0xF8F * 8 + 6)
#define                                 CCP9IF_bit          _BIT_ACCESS(PIR4,6)
// IPR4<CCP9IP>
extern volatile __bit                   CCP9IP              __at(0x7C86);	// @ (0xF90 * 8 + 6)
#define                                 CCP9IP_bit          _BIT_ACCESS(IPR4,6)
// CCP9CON<CCP9M0>
extern volatile __bit                   CCP9M0              __at(0x7818);	// @ (0xF03 * 8 + 0)
#define                                 CCP9M0_bit          _BIT_ACCESS(CCP9CON,0)
// CCP9CON<CCP9M1>
extern volatile __bit                   CCP9M1              __at(0x7819);	// @ (0xF03 * 8 + 1)
#define                                 CCP9M1_bit          _BIT_ACCESS(CCP9CON,1)
// CCP9CON<CCP9M2>
extern volatile __bit                   CCP9M2              __at(0x781A);	// @ (0xF03 * 8 + 2)
#define                                 CCP9M2_bit          _BIT_ACCESS(CCP9CON,2)
// CCP9CON<CCP9M3>
extern volatile __bit                   CCP9M3              __at(0x781B);	// @ (0xF03 * 8 + 3)
#define                                 CCP9M3_bit          _BIT_ACCESS(CCP9CON,3)
// PMDIS3<CCP9MD>
extern volatile __bit                   CCP9MD              __at(0x75E6);	// @ (0xEBC * 8 + 6)
#define                                 CCP9MD_bit          _BIT_ACCESS(PMDIS3,6)
// ODCON2<CCP9OD>
extern volatile __bit                   CCP9OD              __at(0x7A0A);	// @ (0xF41 * 8 + 2)
#define                                 CCP9OD_bit          _BIT_ACCESS(ODCON2,2)
// ALRMCFG<CHIME>
extern volatile __bit                   CHIME               __at(0x7A3E);	// @ (0xF47 * 8 + 6)
#define                                 CHIME_bit           _BIT_ACCESS(ALRMCFG,6)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x7E12);	// @ (0xFC2 * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x7E13);	// @ (0xFC2 * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x7E14);	// @ (0xFC2 * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x7E15);	// @ (0xFC2 * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// ADCON1<CHSN3>
extern volatile __bit                   CHSN3               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 CHSN3_bit           _BIT_ACCESS(ADCON1,3)
// PORTC<CK1>
extern volatile __bit                   CK1                 __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 CK1_bit             _BIT_ACCESS(PORTC,6)
// SSP1STAT<CKE1>
extern volatile __bit                   CKE1                __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 CKE1_bit            _BIT_ACCESS(SSP1STAT,6)
// SSP2STAT<CKE2>
extern volatile __bit                   CKE2                __at(0x7B9E);	// @ (0xF73 * 8 + 6)
#define                                 CKE2_bit            _BIT_ACCESS(SSP2STAT,6)
// SSP1CON1<CKP1>
extern volatile __bit                   CKP1                __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CKP1_bit            _BIT_ACCESS(SSP1CON1,4)
// SSP2CON1<CKP2>
extern volatile __bit                   CKP2                __at(0x7B94);	// @ (0xF72 * 8 + 4)
#define                                 CKP2_bit            _BIT_ACCESS(SSP2CON1,4)
// BAUDCON1<CKTXP>
extern volatile __bit                   CKTXP               __at(0x7BF4);	// @ (0xF7E * 8 + 4)
#define                                 CKTXP_bit           _BIT_ACCESS(BAUDCON1,4)
// PORTA<CLKI>
extern volatile __bit                   CLKI                __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 CLKI_bit            _BIT_ACCESS(PORTA,7)
// PORTA<CLKO>
extern volatile __bit                   CLKO                __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 CLKO_bit            _BIT_ACCESS(PORTA,6)
// RCON<CM>
extern volatile __bit                   CM                  __at(0x7E85);	// @ (0xFD0 * 8 + 5)
#define                                 CM_bit              _BIT_ACCESS(RCON,5)
// PIE2<CM1IE>
extern volatile __bit                   CM1IE               __at(0x7D05);	// @ (0xFA0 * 8 + 5)
#define                                 CM1IE_bit           _BIT_ACCESS(PIE2,5)
// PIR2<CM1IF>
extern volatile __bit                   CM1IF               __at(0x7D0D);	// @ (0xFA1 * 8 + 5)
#define                                 CM1IF_bit           _BIT_ACCESS(PIR2,5)
// IPR2<CM1IP>
extern volatile __bit                   CM1IP               __at(0x7D15);	// @ (0xFA2 * 8 + 5)
#define                                 CM1IP_bit           _BIT_ACCESS(IPR2,5)
// PIE2<CM2IE>
extern volatile __bit                   CM2IE               __at(0x7D06);	// @ (0xFA0 * 8 + 6)
#define                                 CM2IE_bit           _BIT_ACCESS(PIE2,6)
// PIR2<CM2IF>
extern volatile __bit                   CM2IF               __at(0x7D0E);	// @ (0xFA1 * 8 + 6)
#define                                 CM2IF_bit           _BIT_ACCESS(PIR2,6)
// IPR2<CM2IP>
extern volatile __bit                   CM2IP               __at(0x7D16);	// @ (0xFA2 * 8 + 6)
#define                                 CM2IP_bit           _BIT_ACCESS(IPR2,6)
// PIE5<CM3IE>
extern volatile __bit                   CM3IE               __at(0x7C8D);	// @ (0xF91 * 8 + 5)
#define                                 CM3IE_bit           _BIT_ACCESS(PIE5,5)
// PIR5<CM3IF>
extern volatile __bit                   CM3IF               __at(0x7CC5);	// @ (0xF98 * 8 + 5)
#define                                 CM3IF_bit           _BIT_ACCESS(PIR5,5)
// IPR5<CM3IP>
extern volatile __bit                   CM3IP               __at(0x7CCD);	// @ (0xF99 * 8 + 5)
#define                                 CM3IP_bit           _BIT_ACCESS(IPR5,5)
// PIE2<CMIE>
extern volatile __bit                   CMIE                __at(0x7D06);	// @ (0xFA0 * 8 + 6)
#define                                 CMIE_bit            _BIT_ACCESS(PIE2,6)
// PIR2<CMIF>
extern volatile __bit                   CMIF                __at(0x7D0E);	// @ (0xFA1 * 8 + 6)
#define                                 CMIF_bit            _BIT_ACCESS(PIR2,6)
// IPR2<CMIP>
extern volatile __bit                   CMIP                __at(0x7D16);	// @ (0xFA2 * 8 + 6)
#define                                 CMIP_bit            _BIT_ACCESS(IPR2,6)
// PMDIS2<CMP1MD>
extern volatile __bit                   CMP1MD              __at(0x75D8);	// @ (0xEBB * 8 + 0)
#define                                 CMP1MD_bit          _BIT_ACCESS(PMDIS2,0)
// PMDIS2<CMP2MD>
extern volatile __bit                   CMP2MD              __at(0x75D9);	// @ (0xEBB * 8 + 1)
#define                                 CMP2MD_bit          _BIT_ACCESS(PMDIS2,1)
// PMDIS2<CMP3MD>
extern volatile __bit                   CMP3MD              __at(0x75DA);	// @ (0xEBB * 8 + 2)
#define                                 CMP3MD_bit          _BIT_ACCESS(PMDIS2,2)
// PSTR2CON<CMPL02>
extern volatile __bit                   CMPL02              __at(0x7DCE);	// @ (0xFB9 * 8 + 6)
#define                                 CMPL02_bit          _BIT_ACCESS(PSTR2CON,6)
// PSTR3CON<CMPL03>
extern volatile __bit                   CMPL03              __at(0x78D6);	// @ (0xF1A * 8 + 6)
#define                                 CMPL03_bit          _BIT_ACCESS(PSTR3CON,6)
// PSTR2CON<CMPL12>
extern volatile __bit                   CMPL12              __at(0x7DCF);	// @ (0xFB9 * 8 + 7)
#define                                 CMPL12_bit          _BIT_ACCESS(PSTR2CON,7)
// PSTR3CON<CMPL13>
extern volatile __bit                   CMPL13              __at(0x78D7);	// @ (0xF1A * 8 + 7)
#define                                 CMPL13_bit          _BIT_ACCESS(PSTR3CON,7)
// CM1CON<COE1>
extern volatile __bit                   COE1                __at(0x7E96);	// @ (0xFD2 * 8 + 6)
#define                                 COE1_bit            _BIT_ACCESS(CM1CON,6)
// CM2CON<COE2>
extern volatile __bit                   COE2                __at(0x7E8E);	// @ (0xFD1 * 8 + 6)
#define                                 COE2_bit            _BIT_ACCESS(CM2CON,6)
// CM3CON<COE3>
extern volatile __bit                   COE3                __at(0x792E);	// @ (0xF25 * 8 + 6)
#define                                 COE3_bit            _BIT_ACCESS(CM3CON,6)
// CM1CON<CON1>
extern volatile __bit                   CON1                __at(0x7E97);	// @ (0xFD2 * 8 + 7)
#define                                 CON1_bit            _BIT_ACCESS(CM1CON,7)
// CM2CON<CON2>
extern volatile __bit                   CON2                __at(0x7E8F);	// @ (0xFD1 * 8 + 7)
#define                                 CON2_bit            _BIT_ACCESS(CM2CON,7)
// CM3CON<CON3>
extern volatile __bit                   CON3                __at(0x792F);	// @ (0xF25 * 8 + 7)
#define                                 CON3_bit            _BIT_ACCESS(CM3CON,7)
// CMSTAT<COUT1>
extern volatile __bit                   COUT1               __at(0x7B80);	// @ (0xF70 * 8 + 0)
#define                                 COUT1_bit           _BIT_ACCESS(CMSTAT,0)
// CMSTAT<COUT2>
extern volatile __bit                   COUT2               __at(0x7B81);	// @ (0xF70 * 8 + 1)
#define                                 COUT2_bit           _BIT_ACCESS(CMSTAT,1)
// CMSTAT<COUT3>
extern volatile __bit                   COUT3               __at(0x7B82);	// @ (0xF70 * 8 + 2)
#define                                 COUT3_bit           _BIT_ACCESS(CMSTAT,2)
// CM1CON<CPOL1>
extern volatile __bit                   CPOL1               __at(0x7E95);	// @ (0xFD2 * 8 + 5)
#define                                 CPOL1_bit           _BIT_ACCESS(CM1CON,5)
// CM2CON<CPOL2>
extern volatile __bit                   CPOL2               __at(0x7E8D);	// @ (0xFD1 * 8 + 5)
#define                                 CPOL2_bit           _BIT_ACCESS(CM2CON,5)
// CM3CON<CPOL3>
extern volatile __bit                   CPOL3               __at(0x792D);	// @ (0xF25 * 8 + 5)
#define                                 CPOL3_bit           _BIT_ACCESS(CM3CON,5)
// UEIE<CRC16EE>
extern volatile __bit                   CRC16EE             __at(0x79BA);	// @ (0xF37 * 8 + 2)
#define                                 CRC16EE_bit         _BIT_ACCESS(UEIE,2)
// UEIR<CRC16EF>
extern volatile __bit                   CRC16EF             __at(0x7B1A);	// @ (0xF63 * 8 + 2)
#define                                 CRC16EF_bit         _BIT_ACCESS(UEIR,2)
// UEIE<CRC5EE>
extern volatile __bit                   CRC5EE              __at(0x79B9);	// @ (0xF37 * 8 + 1)
#define                                 CRC5EE_bit          _BIT_ACCESS(UEIE,1)
// UEIR<CRC5EF>
extern volatile __bit                   CRC5EF              __at(0x7B19);	// @ (0xF63 * 8 + 1)
#define                                 CRC5EF_bit          _BIT_ACCESS(UEIR,1)
// CM1CON<CREF1>
extern volatile __bit                   CREF1               __at(0x7E92);	// @ (0xFD2 * 8 + 2)
#define                                 CREF1_bit           _BIT_ACCESS(CM1CON,2)
// CM2CON<CREF2>
extern volatile __bit                   CREF2               __at(0x7E8A);	// @ (0xFD1 * 8 + 2)
#define                                 CREF2_bit           _BIT_ACCESS(CM2CON,2)
// CM3CON<CREF3>
extern volatile __bit                   CREF3               __at(0x792A);	// @ (0xF25 * 8 + 2)
#define                                 CREF3_bit           _BIT_ACCESS(CM3CON,2)
// RCSTA1<CREN1>
extern volatile __bit                   CREN1               __at(0x7D64);	// @ (0xFAC * 8 + 4)
#define                                 CREN1_bit           _BIT_ACCESS(RCSTA1,4)
// RCSTA2<CREN2>
extern volatile __bit                   CREN2               __at(0x7CE4);	// @ (0xF9C * 8 + 4)
#define                                 CREN2_bit           _BIT_ACCESS(RCSTA2,4)
// PORTE<CS>
extern volatile __bit                   CS                  __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 CS_bit              _BIT_ACCESS(PORTE,2)
// PMADDRH<CS1>
extern volatile __bit                   CS1                 __at(0x7B7E);	// @ (0xF6F * 8 + 6)
#define                                 CS1_bit             _BIT_ACCESS(PMADDRH,6)
// PMCONL<CS1P>
extern volatile __bit                   CS1P                __at(0x7AF3);	// @ (0xF5E * 8 + 3)
#define                                 CS1P_bit            _BIT_ACCESS(PMCONL,3)
// PMCONL<CSF0>
extern volatile __bit                   CSF0                __at(0x7AF6);	// @ (0xF5E * 8 + 6)
#define                                 CSF0_bit            _BIT_ACCESS(PMCONL,6)
// PMCONL<CSF1>
extern volatile __bit                   CSF1                __at(0x7AF7);	// @ (0xF5E * 8 + 7)
#define                                 CSF1_bit            _BIT_ACCESS(PMCONL,7)
// TXSTA1<CSRC1>
extern volatile __bit                   CSRC1               __at(0x7D6F);	// @ (0xFAD * 8 + 7)
#define                                 CSRC1_bit           _BIT_ACCESS(TXSTA1,7)
// TXSTA2<CSRC2>
extern volatile __bit                   CSRC2               __at(0x7D47);	// @ (0xFA8 * 8 + 7)
#define                                 CSRC2_bit           _BIT_ACCESS(TXSTA2,7)
// PORTB<CTED1>
extern volatile __bit                   CTED1               __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 CTED1_bit           _BIT_ACCESS(PORTB,2)
// PORTB<CTED2>
extern volatile __bit                   CTED2               __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CTED2_bit           _BIT_ACCESS(PORTB,3)
// CTMUCONH<CTMUEN>
extern volatile __bit                   CTMUEN              __at(0x7D9F);	// @ (0xFB3 * 8 + 7)
#define                                 CTMUEN_bit          _BIT_ACCESS(CTMUCONH,7)
// PIE3<CTMUIE>
extern volatile __bit                   CTMUIE              __at(0x7D1A);	// @ (0xFA3 * 8 + 2)
#define                                 CTMUIE_bit          _BIT_ACCESS(PIE3,2)
// PIR3<CTMUIF>
extern volatile __bit                   CTMUIF              __at(0x7D22);	// @ (0xFA4 * 8 + 2)
#define                                 CTMUIF_bit          _BIT_ACCESS(PIR3,2)
// IPR3<CTMUIP>
extern volatile __bit                   CTMUIP              __at(0x7D2A);	// @ (0xFA5 * 8 + 2)
#define                                 CTMUIP_bit          _BIT_ACCESS(IPR3,2)
// PMDIS1<CTMUMD>
extern volatile __bit                   CTMUMD              __at(0x75D6);	// @ (0xEBA * 8 + 6)
#define                                 CTMUMD_bit          _BIT_ACCESS(PMDIS1,6)
// CTMUCONH<CTMUSIDL>
extern volatile __bit                   CTMUSIDL            __at(0x7D9D);	// @ (0xFB3 * 8 + 5)
#define                                 CTMUSIDL_bit        _BIT_ACCESS(CTMUCONH,5)
// PORTC<CTPLS>
extern volatile __bit                   CTPLS               __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 CTPLS_bit           _BIT_ACCESS(PORTC,2)
// CTMUCONH<CTTRIG>
extern volatile __bit                   CTTRIG              __at(0x7D98);	// @ (0xFB3 * 8 + 0)
#define                                 CTTRIG_bit          _BIT_ACCESS(CTMUCONH,0)
// CVRCON<CVR0>
extern volatile __bit                   CVR0                __at(0x7A98);	// @ (0xF53 * 8 + 0)
#define                                 CVR0_bit            _BIT_ACCESS(CVRCON,0)
// CVRCON<CVR1>
extern volatile __bit                   CVR1                __at(0x7A99);	// @ (0xF53 * 8 + 1)
#define                                 CVR1_bit            _BIT_ACCESS(CVRCON,1)
// CVRCON<CVR2>
extern volatile __bit                   CVR2                __at(0x7A9A);	// @ (0xF53 * 8 + 2)
#define                                 CVR2_bit            _BIT_ACCESS(CVRCON,2)
// CVRCON<CVR3>
extern volatile __bit                   CVR3                __at(0x7A9B);	// @ (0xF53 * 8 + 3)
#define                                 CVR3_bit            _BIT_ACCESS(CVRCON,3)
// PORTA<CVREF>
extern volatile __bit                   CVREF               __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 CVREF_bit           _BIT_ACCESS(PORTA,2)
// CVRCON<CVREN>
extern volatile __bit                   CVREN               __at(0x7A9F);	// @ (0xF53 * 8 + 7)
#define                                 CVREN_bit           _BIT_ACCESS(CVRCON,7)
// CVRCON<CVROE>
extern volatile __bit                   CVROE               __at(0x7A9E);	// @ (0xF53 * 8 + 6)
#define                                 CVROE_bit           _BIT_ACCESS(CVRCON,6)
// CVRCON<CVROEN>
extern volatile __bit                   CVROEN              __at(0x7A9E);	// @ (0xF53 * 8 + 6)
#define                                 CVROEN_bit          _BIT_ACCESS(CVRCON,6)
// CVRCON<CVRR>
extern volatile __bit                   CVRR                __at(0x7A9D);	// @ (0xF53 * 8 + 5)
#define                                 CVRR_bit            _BIT_ACCESS(CVRCON,5)
// CVRCON<CVRSS>
extern volatile __bit                   CVRSS               __at(0x7A9C);	// @ (0xF53 * 8 + 4)
#define                                 CVRSS_bit           _BIT_ACCESS(CVRCON,4)
// SSP1STAT<DA>
extern volatile __bit                   DA                  __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA_bit              _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<DA1>
extern volatile __bit                   DA1                 __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA1_bit             _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DA2>
extern volatile __bit                   DA2                 __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 DA2_bit             _BIT_ACCESS(SSP2STAT,5)
// SSP1STAT<DATA_ADDRESS>
extern volatile __bit                   DATA_ADDRESS        __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DATA_ADDRESS_bit    _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DATA_ADDRESS2>
extern volatile __bit                   DATA_ADDRESS2       __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 DATA_ADDRESS2_bit   _BIT_ACCESS(SSP2STAT,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x7EC1);	// @ (0xFD8 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP10CON<DC10B0>
extern volatile __bit                   DC10B0              __at(0x7804);	// @ (0xF00 * 8 + 4)
#define                                 DC10B0_bit          _BIT_ACCESS(CCP10CON,4)
// CCP10CON<DC10B1>
extern volatile __bit                   DC10B1              __at(0x7805);	// @ (0xF00 * 8 + 5)
#define                                 DC10B1_bit          _BIT_ACCESS(CCP10CON,5)
// CCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0x7DD4);	// @ (0xFBA * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DC1B1>
extern volatile __bit                   DC1B1               __at(0x7DD5);	// @ (0xFBA * 8 + 5)
#define                                 DC1B1_bit           _BIT_ACCESS(CCP1CON,5)
// CCP2CON<DC2B0>
extern volatile __bit                   DC2B0               __at(0x7DA4);	// @ (0xFB4 * 8 + 4)
#define                                 DC2B0_bit           _BIT_ACCESS(CCP2CON,4)
// CCP2CON<DC2B1>
extern volatile __bit                   DC2B1               __at(0x7DA5);	// @ (0xFB4 * 8 + 5)
#define                                 DC2B1_bit           _BIT_ACCESS(CCP2CON,5)
// CCP3CON<DC3B0>
extern volatile __bit                   DC3B0               __at(0x78AC);	// @ (0xF15 * 8 + 4)
#define                                 DC3B0_bit           _BIT_ACCESS(CCP3CON,4)
// CCP3CON<DC3B1>
extern volatile __bit                   DC3B1               __at(0x78AD);	// @ (0xF15 * 8 + 5)
#define                                 DC3B1_bit           _BIT_ACCESS(CCP3CON,5)
// CCP4CON<DC4B0>
extern volatile __bit                   DC4B0               __at(0x7894);	// @ (0xF12 * 8 + 4)
#define                                 DC4B0_bit           _BIT_ACCESS(CCP4CON,4)
// CCP4CON<DC4B1>
extern volatile __bit                   DC4B1               __at(0x7895);	// @ (0xF12 * 8 + 5)
#define                                 DC4B1_bit           _BIT_ACCESS(CCP4CON,5)
// CCP5CON<DC5B0>
extern volatile __bit                   DC5B0               __at(0x787C);	// @ (0xF0F * 8 + 4)
#define                                 DC5B0_bit           _BIT_ACCESS(CCP5CON,4)
// CCP5CON<DC5B1>
extern volatile __bit                   DC5B1               __at(0x787D);	// @ (0xF0F * 8 + 5)
#define                                 DC5B1_bit           _BIT_ACCESS(CCP5CON,5)
// CCP6CON<DC6B0>
extern volatile __bit                   DC6B0               __at(0x7864);	// @ (0xF0C * 8 + 4)
#define                                 DC6B0_bit           _BIT_ACCESS(CCP6CON,4)
// CCP6CON<DC6B1>
extern volatile __bit                   DC6B1               __at(0x7865);	// @ (0xF0C * 8 + 5)
#define                                 DC6B1_bit           _BIT_ACCESS(CCP6CON,5)
// CCP7CON<DC7B0>
extern volatile __bit                   DC7B0               __at(0x784C);	// @ (0xF09 * 8 + 4)
#define                                 DC7B0_bit           _BIT_ACCESS(CCP7CON,4)
// CCP7CON<DC7B1>
extern volatile __bit                   DC7B1               __at(0x784D);	// @ (0xF09 * 8 + 5)
#define                                 DC7B1_bit           _BIT_ACCESS(CCP7CON,5)
// CCP8CON<DC8B0>
extern volatile __bit                   DC8B0               __at(0x7834);	// @ (0xF06 * 8 + 4)
#define                                 DC8B0_bit           _BIT_ACCESS(CCP8CON,4)
// CCP8CON<DC8B1>
extern volatile __bit                   DC8B1               __at(0x7835);	// @ (0xF06 * 8 + 5)
#define                                 DC8B1_bit           _BIT_ACCESS(CCP8CON,5)
// CCP9CON<DC9B0>
extern volatile __bit                   DC9B0               __at(0x781C);	// @ (0xF03 * 8 + 4)
#define                                 DC9B0_bit           _BIT_ACCESS(CCP9CON,4)
// CCP9CON<DC9B1>
extern volatile __bit                   DC9B1               __at(0x781D);	// @ (0xF03 * 8 + 5)
#define                                 DC9B1_bit           _BIT_ACCESS(CCP9CON,5)
// UEIE<DFN8EE>
extern volatile __bit                   DFN8EE              __at(0x79BB);	// @ (0xF37 * 8 + 3)
#define                                 DFN8EE_bit          _BIT_ACCESS(UEIE,3)
// UEIR<DFN8EF>
extern volatile __bit                   DFN8EF              __at(0x7B1B);	// @ (0xF63 * 8 + 3)
#define                                 DFN8EF_bit          _BIT_ACCESS(UEIR,3)
// USTAT<DIR>
extern volatile __bit                   DIR                 __at(0x7B22);	// @ (0xF64 * 8 + 2)
#define                                 DIR_bit             _BIT_ACCESS(USTAT,2)
// DMACON2<DLYCYC0>
extern volatile __bit                   DLYCYC0             __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 DLYCYC0_bit         _BIT_ACCESS(DMACON2,4)
// DMACON2<DLYCYC1>
extern volatile __bit                   DLYCYC1             __at(0x7C35);	// @ (0xF86 * 8 + 5)
#define                                 DLYCYC1_bit         _BIT_ACCESS(DMACON2,5)
// DMACON2<DLYCYC2>
extern volatile __bit                   DLYCYC2             __at(0x7C36);	// @ (0xF86 * 8 + 6)
#define                                 DLYCYC2_bit         _BIT_ACCESS(DMACON2,6)
// DMACON2<DLYCYC3>
extern volatile __bit                   DLYCYC3             __at(0x7C37);	// @ (0xF86 * 8 + 7)
